'''
Задача: посчитать сколько счатливых билетиков (сумма левых трех цифр равна сумме правых трех цифр)
в серии билетиков от 000000 до 999999
Variant 1: "В ЛОБ"
'''

N=0

for i in range(0,1000000):
         A = int(i/100000)
         B = int(i/10000) - A*10
         C = int(i/1000)  - A*100 - B*10
         X = int(i/100)   - A*1000 - B*100 - C*10
         Y = int(i/10)    - A*10000 - B*1000 - C*100 -X*10
         Z = i - A*100000 -B*10000 -C*1000 - X*100 - Y*10
         if (A+B+C == X+Y+Z):
#                print (A,B,C,X,Y,Z)
                N += 1
print("Счастилвых билектиков в рулоне: ", N)